## Plan Result (prod_shutter_webapp)




<pre><code>Plan: 190 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;adoption&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;cft-api-mgmt&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;cmc&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;cmc-legal&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;div-amend&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;div-da&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;div-dn&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;div-pfe&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;div-rfe&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;dtsse-ardoq-adapter&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;et-sya&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;fact&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;fact-admin&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;fact-redirect&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;fees-register&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;gateway-ccd&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;hmi-apim&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;ia-aip&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;idam-user-dashboard&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;idam-web-admin&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;idam-web-public&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;jui-redirect&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;lau&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;manage-payments&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;nfdiv-civil-partnership&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;paybubble&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;payment-outcome&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;pcq&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;private-law&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;probate&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;reformscan&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;return-case-doc-ccd&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sptribs-frontend&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sscs-cor&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sscs-tribunals&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sscs-tya&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;xui-approve-org&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;xui-manage-org&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;xui-register-org&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;xui-webapp&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;adoption&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;cft-api-mgmt&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;cmc&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;cmc-legal&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-amend&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-da&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-dn&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-pfe&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-rfe&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;dtsse-ardoq-adapter&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;et-sya&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;fact&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;fact-admin&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;fact-redirect&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;fees-register&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;gateway-ccd&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;hmi-apim&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;ia-aip&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;idam-user-dashboard&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;idam-web-admin&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;idam-web-public&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;jui-redirect&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;lau&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;manage-payments&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;nfdiv-civil-partnership&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;paybubble&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;payment-outcome&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;pcq&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;private-law&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;probate&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;reformscan&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;return-case-doc-ccd&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sptribs-frontend&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sscs-cor&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sscs-tribunals&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sscs-tya&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;xui-approve-org&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;xui-manage-org&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;xui-register-org&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;xui-webapp&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;adoption&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;cft-api-mgmt&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;cmc&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;cmc-legal&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;div-amend&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;div-da&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;div-dn&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;div-rfe&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;dtsse-ardoq-adapter&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;fact&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;fact-admin&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;fact-redirect&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;hmi-apim&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;ia-aip&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;idam-web-admin&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;idam-web-public&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;lau&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;manage-payments&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;nfdiv-civil-partnership&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;payment-outcome&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;pcq&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;private-law&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;reformscan&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;return-case-doc-ccd&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;sptribs-frontend&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;sscs-cor&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;xui-approve-org&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;xui-manage-org&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;xui-register-org&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;xui-webapp&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;adoption&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;cft-api-mgmt&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;cmc&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;cmc-legal&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;div-amend&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;div-da&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;div-dn&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;div-pfe&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;div-rfe&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;dtsse-ardoq-adapter&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;et-sya&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;fact&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;fact-admin&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;fact-redirect&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;fees-register&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;gateway-ccd&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;hmi-apim&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;ia-aip&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;idam-user-dashboard&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;idam-web-admin&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;idam-web-public&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;jui-redirect&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;lau&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;manage-payments&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;nfdiv-civil-partnership&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;paybubble&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;payment-outcome&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;pcq&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;private-law&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;probate&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;reformscan&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;return-case-doc-ccd&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sptribs-frontend&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sscs-cor&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sscs-tribunals&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sscs-tya&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;xui-approve-org&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;xui-manage-org&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;xui-register-org&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;xui-webapp&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;adoption&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;cft-api-mgmt&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;cmc&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;cmc-legal&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;div-amend&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;div-da&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;div-dn&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;div-pfe&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;div-rfe&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;dtsse-ardoq-adapter&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;et-sya&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;fact&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;fact-admin&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;fact-redirect&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;fees-register&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;gateway-ccd&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;hmi-apim&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;ia-aip&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;idam-user-dashboard&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;idam-web-admin&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;idam-web-public&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;jui-redirect&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;lau&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;manage-payments&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;nfdiv-civil-partnership&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;paybubble&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;payment-outcome&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;pcq&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;private-law&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;probate&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;reformscan&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;return-case-doc-ccd&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sptribs-frontend&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sscs-cor&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sscs-tribunals&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sscs-tya&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;xui-approve-org&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;xui-manage-org&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;xui-register-org&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;xui-webapp&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["adoption"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "apply-for-adoption-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["cmc"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "moneyclaims.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["cmc-legal"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.moneyclaim-legal-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["div-amend"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.manage-application-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["div-da"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.decree-absolute-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["div-dn"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.decree-nisi-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["div-pfe"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = "yellow-bush-06a3c6303.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["div-rfe"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "respond-divorce.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["dtsse-ardoq-adapter"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dtsse-ardoq-adapter-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["et-sya"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = "calm-smoke-0b5f15603.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "claim-employment-tribunals.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["fact"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "find-court-tribunal.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["fact-admin"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "admin-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "find-court-tribunal.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["fact-redirect"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact-redirect-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "courttribunalfinder.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["fees-register"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register-shutter"
      + record              = "red-sea-0d5cc4f03.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["gateway-ccd"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "gateway.ccd-shutter"
      + record              = "zealous-smoke-02adb0303.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["ia-aip"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "appeal-immigration-asylum-decision.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-user-dashboard-shutter"
      + record              = "wonderful-sand-0a492e703.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "hmcts-access.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["jui-redirect"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jui-redirect-shutter"
      + record              = "jolly-stone-05a641503.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "jcm.judiciary.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["lau"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "log-and-audit-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["manage-payments"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-payments-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["nfdiv-civil-partnership"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "end-civil-partnership.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["paybubble"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paybubble-shutter"
      + record              = "lively-smoke-037b03703.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["payment-outcome"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paymentoutcome-web-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["pcq"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "equality-and-diversity-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["private-law"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-to-court-about-child-arrangements-c100.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["probate"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = "yellow-pebble-0fb50b603.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "apply-for-probate.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["reformscan"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformscan-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["return-case-doc-ccd"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "return-case-doc.ccd-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sptribs-frontend"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "special-tribunals.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sscs-cor"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.manage-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sscs-tribunals"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = "orange-field-064f06c03.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sscs-tya"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www-shutter"
      + record              = "victorious-sky-017d49e03.3.azurestaticapps.net"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "track-benefit-appeal.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["xui-approve-org"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "administer-orgs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["xui-manage-org"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-org-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["xui-register-org"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "register-org-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["xui-webapp"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-case-shutter"
      + record    

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

own after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["sscs-cor"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.manage.appeal-benefit-decision.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["sscs-tribunals"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.appeal-benefit-decision.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/sscs-tribunals"
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["sscs-tya"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "www.track-benefit-appeal.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-shutter-webapp-prod-rg/providers/Microsoft.Web/staticSites/sscs-tya"
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["xui-approve-org"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "administer-orgs.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["xui-manage-org"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "manage-org.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["xui-register-org"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "register-org.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["xui-webapp"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "manage-case.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["adoption"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "adoption_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["cft-api-mgmt"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "cft_api_mgmt_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["cmc"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "cmc_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["cmc-legal"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "cmc_legal_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["div-amend"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "div_amend_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["div-da"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "div_da_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["div-dn"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "div_dn_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["div-pfe"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "div_pfe_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["div-rfe"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "div_rfe_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["dtsse-ardoq-adapter"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "dtsse_ardoq_adapter_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["et-sya"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "et_sya_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["fact"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "fact_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["fact-admin"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "fact_admin_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["fact-redirect"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "fact_redirect_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["fees-register"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "fees_register_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["gateway-ccd"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "gateway_ccd_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["hmi-apim"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "hmi_apim_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["ia-aip"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "ia_aip_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["idam-user-dashboard"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "idam_user_dashboard_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["idam-web-admin"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "idam_web_admin_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["idam-web-public"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "idam_web_public_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["jui-redirect"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "jui_redirect_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["lau"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "lau_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["manage-payments"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "manage_payments_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["nfdiv-civil-partnership"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "nfdiv_civil_partnership_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["paybubble"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "paybubble_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["payment-outcome"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "payment_outcome_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["pcq"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "pcq_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["private-law"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "private_law_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["probate"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "probate_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["reformscan"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "reformscan_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["return-case-doc-ccd"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "return_case_doc_ccd_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["sptribs-frontend"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sptribs_frontend_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["sscs-cor"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sscs_cor_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["sscs-tribunals"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sscs_tribunals_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["sscs-tya"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sscs_tya_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["xui-approve-org"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "xui_approve_org_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["xui-manage-org"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "xui_manage_org_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["xui-register-org"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "xui_register_org_prod"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["xui-webapp"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "xui_webapp_prod"
      + updated_at      = (known after apply)
    }

Plan: 190 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1657,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->